VPro/src/Catalogs/WorkSchedules/WorkSchedules.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>WorkSchedules</name>
  <attributes>
    <name>DeleteScheduleType</name>
    <type>
      <types>EnumRef.WorkScheduleTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>WorkweekDuration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BeginnigDate</name>
    <comment>(Common)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Calendar</name>
    <type>
      <types>CatalogRef.Calendars</types>
    </type>
  </attributes>
  <attributes>
    <name>Color</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>BusinessCalendar</name>
    <type>
      <types>CatalogRef.BusinessCalendars</types>
    </type>
  </attributes>
  <attributes>
    <name>FillMethod</name>
    <type>
      <types>EnumRef.WorkScheduleFillingMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>UseSchedule</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AccountHolidays</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NotValid</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Periods</name>
    <attributes>
      <name>DayNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BeginTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EndTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>WorkSchedule</name>
    <attributes>
      <name>CycleDayNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BeginTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EndTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>WorkHoursQuantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>TimeBreak</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DayIncludedInSchedule</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Active</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Breaks</name>
    <attributes>
      <name>DayNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BeginTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EndTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Duration</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>TemplateByYear</name>
    <attributes>
      <name>Year</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>TemplateGraphFill</name>
      <type>
        <types>CatalogRef.WorkTimeGraphsTemplates</types>
      </type>
    </attributes>
    <attributes>
      <name>BeginnigDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ScheduleType</name>
      <type>
        <types>EnumRef.WorkScheduleTypes</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalFillingSettings</name>
    <attributes>
      <name>SettingValue</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BeginTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EndTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>WorkHoursQuantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>TimeBreak</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalFillingSettingsPeriods</name>
    <attributes>
      <name>SettingValue</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BeginTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EndTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Duration</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BreakHours</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>GraphPeriods</name>
    <attributes>
      <name>CycleDayNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BeginTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EndTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Duration</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BreakHours</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

VPro/src/Catalogs/Employees/Employees.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Employees</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Ind</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
  <attributes>
    <name>OccupationType</name>
    <type>
      <types>EnumRef.OccupationTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>SettlementsHumanResourcesGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>AdvanceHoldersGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>OverrunGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>NotValid</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

VPro/src/Catalogs/WorkSchedules/Forms/WorkSchedulesListForm/Module.bsl
&AtClient
Procedure ListOnActivateRow(Item)
	
	CurrentData = Items.List.CurrentData;
	
	If CurrentData = Undefined Then Return EndIf;
	
	CurrentList = ?(FilterByGraph = "Employees", EmployeesByGraph, EntitiesByGraph);
	
	CommonUseClientServer.SetFilterDynamicListItem(CurrentList, 
		"WorkSchedule",
		CurrentData.Ref,
		DataCompositionComparisonType.Equal);
	
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	FilterField = New DataCompositionField("NotValid");
	
	НовыйОтбор = List.Filter.Items.Add(Type("DataCompositionFilterItem"));
	НовыйОтбор.Use = True;
	НовыйОтбор.LeftValue = FilterField;
	НовыйОтбор.RightValue = False;
	НовыйОтбор.ComparisonType = DataCompositionComparisonType.Equal;
	
	If Parameters.Property("Subsystem") Then
		SubsystemType = Parameters.Subsystem;
		
		ЕстьВыводПоПодсистемам = False;
		
		If GetFunctionalOption("UseSubsystemPayroll") Then
			Items.ОтборПографику.ChoiceList.Add("Employees", NStr("en='Employees';vi='Nhân viên'"));
			
			If SubsystemType = 2 Then
				
				Items.ОтборПографику.ChoiceList.Add("Employees", NStr("en='Employees';vi='Nhân viên'"));
				
				Items.СущностиПоГрафикуEnterpriseResource.Title = NStr("en='Employees on graphics';vi='Nhân viên trên lịch'");
				Items.ОтборПографику.Visible = False;
				
				Items.СотрудникиПоГрафику.Visible = True;
				Items.СущностиПоГрафику.Visible = False;
				
				ThisForm.Title = NStr("en='Graphics works сотрудников';vi='Lịch làm việc nhân viên'");
				
				FilterByGraph = "Employees";
				
				ЕстьВыводПоПодсистемам = True;
				
			EndIf;
		EndIf;
		
		If SubsystemType = 1 Then
			
			ThisForm.Title = "Graphics works resource";
			
			If (GetFunctionalOption("PlanCompanyResourcesLoadingWorks")
				Or GetFunctionalOption("PlanCompanyResourcesLoading") 
				Or GetFunctionalOption("PlanCompanyResourcesLoadingEventLog")) Then
				
				Items.ОтборПографику.ChoiceList.Add("Resources", "Resources");
				
				Items.СущностиПоГрафикуEnterpriseResource.Title = NStr("en='Resources on graphics';vi='Tài nguyên trên lịch'");
				
				ThisForm.Title = NStr("en='Graphics works resource';vi='Lịch làm việc tài nguyên'");
				
				FilterByGraph = "Resources";
				
				Items.СотрудникиПоГрафику.Visible = False;
				Items.СущностиПоГрафику.Visible = True;
				
				ЕстьВыводПоПодсистемам = True;
				
			EndIf;
			
		EndIf;
		
		If Not ЕстьВыводПоПодсистемам Then
			SubsystemType = 0;
			Items.ГруппаСущностиПоГрафику.Visible = False;
			Items.ОтборПографику.Visible = False;
		EndIf;
		
	Else
		SubsystemType = 0;
		Items.ГруппаСущностиПоГрафику.Visible = False;
		Items.ОтборПографику.Visible = False;
	EndIf;
	
	SetConditionalAppearance();
	
EndProcedure

&AtServer
Procedure SetConditionalAppearance()

		NewConditionalAppearance = ConditionalAppearance.Items.Add();
		WorkWithForm.AddDataCompositionFilterItem(NewConditionalAppearance.Filter, "List.NotValid", True, DataCompositionComparisonType.Equal);
		WorkWithForm.AddConditionalAppearanceFields(NewConditionalAppearance, "Description");
		WorkWithForm.AddConditionalAppearanceElement(NewConditionalAppearance, "TextColor", StyleColors.TabularSectionUnavailableTextColor);

EndProcedure

&AtClient
Procedure СущностиПоГрафикуSelection(Item, SelectedRow, Field, StandardProcessing)
	
	CurrentData = Items.СущностиПоГрафику.CurrentData;
	If CurrentData = Undefined Then Return EndIf;
	
	If TypeOf(CurrentData.EnterpriseResource) = Type("CatalogRef.KeyResources") Then
		FormParameters = New Structure("Key", CurrentData.EnterpriseResource);
		OpenForm("Catalog.KeyResources.ObjectForm",FormParameters);
	Else
		FormParameters = New Structure("Key", CurrentData.EnterpriseResource);
		OpenForm("Catalog.Teams.ObjectForm",FormParameters);
	EndIf;
	
EndProcedure

&AtClient
Procedure СотрудникиПоГрафикуSelection(Item, SelectedRow, Field, StandardProcessing)

	CurrentData = Items.СотрудникиПоГрафику.CurrentData;
	If CurrentData = Undefined Then Return EndIf;
	
	FormParameters = New Structure("Key", CurrentData.EnterpriseResource);
	OpenForm("Catalog.Employees.ObjectForm",FormParameters);

EndProcedure

&AtClient
Procedure ОтборПографикуOnChange(Item)
	
	УстановитьОтборПоГрафику();
	
EndProcedure

&AtServer
Procedure УстановитьОтборПоГрафику()
	
	If FilterByGraph = "Employees" Then
		
		Items.СотрудникиПоГрафику.Visible = True;
		Items.СущностиПоГрафику.Visible = False;
		
		ThisForm.Title = NStr("en='Graphics works сотрудников';vi='Lịch làm việc nhân viên'");
		
	ElsIf FilterByGraph = "Resources" Then
		
		Items.СотрудникиПоГрафику.Visible = False;
		Items.СущностиПоГрафику.Visible = True;
		
		ThisForm.Title = NStr("en='Graphics works resource';vi='Lịch làm việc tài nguyên'");
		
	EndIf;
	
EndProcedure

&AtClient
Procedure ShowInvalid(Command)
	
	Items.СписокПоказыватьНедействительную.Check = Not Items.СписокПоказыватьНедействительную.Check;
	SetFilterInvalid(ThisObject)

EndProcedure

&AtClientAtServerNoContext
Procedure SetFilterInvalid(Form)
	
	CommonUseClientServer.SetFilterDynamicListItem(
		Form.List,
		"NotValid",
		False,
		,
		,
		Not Form.Items.СписокПоказыватьНедействительную.Check);
	
EndProcedure
